trajers.org
# Test org mode evaluation
#+BEGIN_SRC clojure :results value
agent-num
#+END_SRC

# Start document
* Need code to do the following:
1. Security with single price vector.
2. Informed and uninformed agents: informed agents receive signal, uninformed guess from distribution.
3. Pricing mechanism: draw random price from normal distribution and take orders.  
4. Price updating: based on buy/sell vectors of a single unit.
5. Agent updating: do not trade if price moves the "wrong" way. Instead, update guess.
6. 




