trajers.tex
% Created 2019-07-25 Thu 10:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Matt}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Matt},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\begin{verbatim}
agent-num
\end{verbatim}
\section{Need code to do the following:}
\label{sec:orgbf8bb7e}
\begin{enumerate}
\item Security with single price vector.
\item Informed and uninformed agents: informed agents receive signal, uninformed guess from distribution.
\item Pricing mechanism: draw random price from normal distribution and take orders.
\item Price updating: based on buy/sell vectors of a single unit.
\item Agent updating: do not trade if price moves the "wrong" way. Instead, update guess.
\end{enumerate}
\end{document}
